In [1]:
import pandas as pd

In [2]:
import zipfile

In [3]:
with zipfile.ZipFile("building-consents-issued-september-2020-csv.zip") as z:
    with z.open("building-consents-issued-september-2020-csv.csv") as f:
        dfa = pd.read_csv(f)

KeyError: "There is no item named 'building-consents-issued-september-2020-csv.csv' in the archive"

In [6]:
with zipfile.ZipFile("bigmarket.zip") as z:
    with z.open("bigmarket.csv") as f:
        dfb = pd.read_csv(f)

In [5]:
dfa

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [7]:
dfa = pd.read_csv('alcohol-available-for-consumption-year-ended-december-2019-csv.csv')

In [8]:
dfa.shape

(10992, 13)

In [9]:
dfa

,Series_reference,Period,Data_value,STATUS,UNITS,MAGNTUDE,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,ALCA.S1,1935.12,51.100000,FINAL,Litres,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Beer,NaN,NaN,NaN,NaN
1,ALCA.S1,1936.12,58.700000,FINAL,Litres,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Beer,NaN,NaN,NaN,NaN
2,ALCA.S1,1937.12,68.700000,FINAL,Litres,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Beer,NaN,NaN,NaN,NaN
3,ALCA.S1,1938.12,78.100000,FINAL,Litres,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Beer,NaN,NaN,NaN,NaN
4,ALCA.S1,1939.12,79.200000,FINAL,Litres,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Beer,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
10987,ALCQ.SAZZ,2018.12,155.378470,FINAL,Litres,6,Alcohol Available for Consumption - ALC,Litres of Beverage,Total all beverages,NaN,NaN,NaN,NaN
10988,ALCQ.SAZZ,2019.03,114.181641,FINAL,Litres,6,Alcohol Available for Consumption - ALC,Litres of Beverage,Total all beverages,NaN,NaN,NaN,NaN
10989,ALCQ.SAZZ,2019.06,105.113219,FINAL,Litres,6,Alcohol Available for Consumption - ALC,Litres of Beverage,Total all beverages,NaN,NaN,NaN,NaN
10990,ALCQ.SAZZ,2019.09,111.008775,FINAL,Litres,6,Alcohol Available for Consumption - ALC,Litres of Beverage,Total all beverages,NaN,NaN,NaN,NaN
10991,ALCQ.SAZZ,2019.12,160.533294,PROVISIONAL,Litres,6,Alcohol Available for Consumption - ALC,Litres of Beverage,Total all beverages,NaN,NaN,NaN,NaN

In [10]:
dfa.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10992 entries, 0 to 10991
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  10992 non-null  object
 1   Period            10992 non-null  float64
 2   Data_value        10987 non-null  float64
 3   STATUS            10992 non-null  object
 4   UNITS             10992 non-null  object
 5   MAGNTUDE          10992 non-null  int64
 6   Subject           10992 non-null  object
 7   Group             10992 non-null  object
 8   Series_title_1    10992 non-null  object
 9   Series_title_2    0 non-null      float64
 10  Series_title_3    0 non-null      float64
 11  Series_title_4    0 non-null      float64
 12  Series_title_5    0 non-null      float64
dtypes: float64(6), int64(1), object(6)
memory usage: 1.1+ MB

In [11]:
dfa['Series_title_1']

0                       Beer
1                       Beer
2                       Beer
3                       Beer
4                       Beer
                ...
10987    Total all beverages
10988    Total all beverages
10989    Total all beverages
10990    Total all beverages
10991    Total all beverages
Name: Series_title_1, Length: 10992, dtype: object

In [12]:
dfa['Series_title_1'].nunique()

51

In [13]:
dfa['Series_title_1'].unique()

array(['Beer', 'Wine', 'Spirits', 'Beer Per Head', 'Wine Per Head',
       'Spirits Per Head', 'Beer containing not more than 1.150% alcohol',
       'Beer containing between 1.151% and 2.500% alc',
       'Beer containing between 2.501% and 4.350% alc',
       'Beer containing between 4.351% and 5.000% alc',
       'Beer containing more than 5.00% alcohol', 'Total beer',
       'Total spirits (proof litres)',
       'Spirits containing not more than 23% alcohol',
       'Spirits containing more than 23% alcohol', 'Total spirits',
       'Table wine (disc. Sept 1999)', 'Fortified wine (disc. Sept 1999)',
       'Total wine (disc. Sept 1999)',
       'Grape wine containing not more than 14% alc.',
       'Grape wine containing more than 14% alcohol',
       'Other wine containing not more than 14% alc.',
       'Other wine containing more than 14% alcohol',
       'Total wine containing not more than 14% alc.',
       'Total wine containing more than 14% alcohol', 'Total wine',
       'Total N.Z. Population 15 Years and Over for Total Alcohol',
       'Total N.Z. Population 18 Years and Over for Total Alcohol',
       'Total N.Z. Population 20 Years and Over for Total Alcohol',
       'Total N.Z. Population for Total Alcohol',
       'Total N.Z. Population 15 Years and Over for Total Beer',
       'Total N.Z. Population 18 Years and Over for Total Beer',
       'Total N.Z. Population 20 Years and Over for Total Beer',
       'Total N.Z. Population for Total Beer',
       'Total N.Z. Population 15 Years and Over for Total Wine',
       'Total N.Z. Population 18 Years and Over for Total Wine',
       'Total N.Z. Population 20 Years and Over for Total Wine',
       'Total N.Z. Population for Total Wine',
       'Total N.Z. Population 15 Years and Over for Total Spirits',
       'Total N.Z. Population 18 Years and Over for Total Spirits',
       'Total N.Z. Population 20 Years and Over for Total Spirits',
       'Total N.Z. Population for Total Spirits',
       'Total N.Z. Population 15 Years and Over for Spirits containing not more than 23% alcohol',
       'Total N.Z. Population 18 Years and Over for Spirits containing not more than 23% alcohol',
       'Total N.Z. Population 20 Years and Over for Spirits containing not more than 23% alcohol',
       'Total N.Z. Population for Spirits containing not more than 23% alcohol',
       'Total N.Z. Population 15 Years and Over for Spirits containing more than 23% alcohol',
       'Total N.Z. Population 18 Years and Over for Spirits containing more than 23% alcohol',
       'Total N.Z. Population 20 Years and Over for Spirits containing more than 23% alcohol',
       'Total N.Z. Population for Spirits containing more than 23% alcohol',
       'Total all beverages'], dtype=object)

In [14]:
dfa['Series_title_1'].value_counts()

Total spirits                                                                               578
Total beer                                                                                  564
Total all beverages                                                                         550
Total wine                                                                                  402
Spirits containing more than 23% alcohol                                                    402
Grape wine containing not more than 14% alc.                                                402
Other wine containing not more than 14% alc.                                                402
Grape wine containing more than 14% alcohol                                                 402
Total wine containing more than 14% alcohol                                                 402
Other wine containing more than 14% alcohol                                                 402
Spirits containing not more than 23% alcohol                                                402
Total wine containing not more than 14% alc.                                                402
Total spirits (proof litres)                                                                289
Total N.Z. Population 18 Years and Over for Total Alcohol                                   277
Total N.Z. Population for Total Alcohol                                                     277
Total N.Z. Population 20 Years and Over for Total Alcohol                                   277
Total N.Z. Population 15 Years and Over for Total Alcohol                                   275
Table wine (disc. Sept 1999)                                                                240
Total wine (disc. Sept 1999)                                                                240
Fortified wine (disc. Sept 1999)                                                            240
Beer containing more than 5.00% alcohol                                                     157
Beer containing between 4.351% and 5.000% alc                                               157
Beer containing between 1.151% and 2.500% alc                                               157
Beer containing not more than 1.150% alcohol                                                157
Beer containing between 2.501% and 4.350% alc                                               157
Total N.Z. Population 18 Years and Over for Total Spirits                                   125
Total N.Z. Population 15 Years and Over for Spirits containing not more than 23% alcohol    125
Total N.Z. Population 18 Years and Over for Total Wine                                      125
Total N.Z. Population 15 Years and Over for Total Wine                                      125
Total N.Z. Population 20 Years and Over for Total Spirits                                   125
Total N.Z. Population 15 Years and Over for Total Spirits                                   125
Total N.Z. Population for Total Beer                                                        125
Total N.Z. Population 18 Years and Over for Total Beer                                      125
Total N.Z. Population 15 Years and Over for Spirits containing more than 23% alcohol        125
Total N.Z. Population for Total Spirits                                                     125
Total N.Z. Population 20 Years and Over for Spirits containing more than 23% alcohol        125
Total N.Z. Population for Total Wine                                                        125
Total N.Z. Population 20 Years and Over for Spirits containing not more than 23% alcohol    125
Total N.Z. Population 18 Years and Over for Spirits containing more than 23% alcohol        125
Total N.Z. Population for Spirits containing more than 23% alcohol                          125
Total N.Z. Population 18 Years and Over for Spirits containing not more than 23% alcohol    125
Total N.Z. Population for Spirits containing not more than 23% alcohol                      125
Total N.Z. Population 20 Years and Over for Total Wine                                      125
Total N.Z. Population 15 Years and Over for Total Beer                                      125
Total N.Z. Population 20 Years and Over for Total Beer                                      125
Spirits Per Head                                                                             47
Spirits                                                                                      47
Beer Per Head                                                                                47
Beer                                                                                         47
Wine                                                                                         47
Wine Per Head                                                                                47
Name: Series_title_1, dtype: int64

In [15]:
dfa['UNITS'].value_counts()

Litres    10898
ProofL       94
Name: UNITS, dtype: int64

In [16]:
dfa[dfa['UNITS'] == 'ProofL']

,Series_reference,Period,Data_value,STATUS,UNITS,MAGNTUDE,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
94,ALCA.S3,1935.12,1.6,FINAL,ProofL,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits,NaN,NaN,NaN,NaN
95,ALCA.S3,1936.12,1.7,FINAL,ProofL,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits,NaN,NaN,NaN,NaN
96,ALCA.S3,1937.12,1.9,FINAL,ProofL,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits,NaN,NaN,NaN,NaN
97,ALCA.S3,1938.12,2.1,FINAL,ProofL,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits,NaN,NaN,NaN,NaN
98,ALCA.S3,1939.12,2.3,FINAL,ProofL,6,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,ALCA.S6,1977.12,3.5,FINAL,ProofL,0,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits Per Head,NaN,NaN,NaN,NaN
278,ALCA.S6,1978.12,3.5,FINAL,ProofL,0,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits Per Head,NaN,NaN,NaN,NaN
279,ALCA.S6,1979.12,3.7,FINAL,ProofL,0,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits Per Head,NaN,NaN,NaN,NaN
280,ALCA.S6,1980.12,3.4,FINAL,ProofL,0,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits Per Head,NaN,NaN,NaN,NaN
281,ALCA.S6,1981.12,3.5,FINAL,ProofL,0,Alcohol Available for Consumption - ALC,(DISC) Volume & Volume Per Head,Spirits Per Head,NaN,NaN,NaN,NaN

#### pandas series

In [17]:
lista = [20, 45, 78, 12, 98, 43]
ser_a = pd.Series(lista)

In [18]:
ser_a

0    20
1    45
2    78
3    12
4    98
5    43
dtype: int64

In [19]:
ser_b = pd.Series(range(2, 33, 3))

In [20]:
ser_b

0      2
1      5
2      8
3     11
4     14
5     17
6     20
7     23
8     26
9     29
10    32
dtype: int64

In [21]:
ser_b = pd.Series(range(2, 17, 3))

In [22]:
len(ser_b)

5

In [23]:
ser_b = pd.Series(range(2, 17, 3), index=['aa', 'bb', 'cc', 'dd', 'ee'])

In [24]:
ser_b

aa     2
bb     5
cc     8
dd    11
ee    14
dtype: int64

In [25]:
capitals = {'greece':'athens', 'UK':'london', 'italy':'rome', 'albania':'tirana'}

In [26]:
ser_c = pd.Series(capitals)

In [27]:
ser_c

greece     athens
UK         london
italy        rome
albania    tirana
dtype: object

In [28]:
ser_c['greece']

'athens'

In [29]:
capitals = {'greece':'athens', 'UK':'london', 'italy':'rome', 'albania':['tirana', 'tirania']}

In [30]:
ser_d = pd.Series(capitals)
ser_d

greece                athens
UK                    london
italy                   rome
albania    [tirana, tirania]
dtype: object

In [31]:
ser_c[1:3]

UK       london
italy      rome
dtype: object

In [32]:
ser_b = pd.Series(range(2, 17, 3), index=['aa', 'bb', 'cc', 'dd', 'ee'])
ser_b

aa     2
bb     5
cc     8
dd    11
ee    14
dtype: int64

In [34]:
ser_b[ser_b > 10]

dd    11
ee    14
dtype: int64

In [35]:
lista = [20, 45, 78, 12, 98, 43]

In [36]:
lista*2.3

TypeError: can't multiply sequence by non-int of type 'float'

In [37]:
lista = [20, 45, 78, 12, 98, 43]
ser_a = pd.Series(lista)
ser_a

0    20
1    45
2    78
3    12
4    98
5    43
dtype: int64

In [38]:
ser_a*2.3

0     46.0
1    103.5
2    179.4
3     27.6
4    225.4
5     98.9
dtype: float64

In [39]:
ser_d = pd.Series([12, 15, 18, 19])
ser_e = pd.Series([11, 13, 16, 21])

In [40]:
ser_d*ser_e

0    132
1    195
2    288
3    399
dtype: int64

In [41]:
ser_d.multiply(ser_e)

0    132
1    195
2    288
3    399
dtype: int64

In [42]:
listb = [12, 5, 8, 9, 13, 56, 76, 32, 95, 47, 88, 38, 65, 73]
ser_f = pd.Series(listb)
ser_f

0     12
1      5
2      8
3      9
4     13
5     56
6     76
7     32
8     95
9     47
10    88
11    38
12    65
13    73
dtype: int64

In [43]:
ser_f.rank()

0      4.0
1      1.0
2      2.0
3      3.0
4      5.0
5      9.0
6     12.0
7      6.0
8     14.0
9      8.0
10    13.0
11     7.0
12    10.0
13    11.0
dtype: float64

In [44]:
ser_f.sort_values()

1      5
2      8
3      9
0     12
4     13
7     32
11    38
9     47
5     56
12    65
13    73
6     76
10    88
8     95
dtype: int64

In [45]:
ser_b = pd.Series(range(2, 17, 3), index=['jj', 'ff', 'cc', 'kk', 'ee'])
ser_b

jj     2
ff     5
cc     8
kk    11
ee    14
dtype: int64

In [46]:
ser_b.sort_index()

cc     8
ee    14
ff     5
jj     2
kk    11
dtype: int64

#### pandas dataframes

In [47]:
dfc = pd.DataFrame(range(2, 17, 3), index=['jj', 'ff', 'cc', 'kk', 'ee'])

In [48]:
dfc

     0
jj   2
ff   5
cc   8
kk  11
ee  14

In [49]:
dfd = pd.DataFrame(capitals)

In [50]:
dfd

   greece      UK italy  albania
0  athens  london  rome   tirana
1  athens  london  rome  tirania

In [51]:
dfd.T

              0        1
greece   athens   athens
UK       london   london
italy      rome     rome
albania  tirana  tirania

In [53]:
store_list = [['vivo', 30000], ['apple', 40000], ['samsung', 65000], ['blackberry',45900]]

In [54]:
dfs = pd.DataFrame(store_list)

In [55]:
dfs

            0      1
0        vivo  30000
1       apple  40000
2     samsung  65000
3  blackberry  45900

In [56]:
dfs = pd.DataFrame(store_list, columns=['store', 'sales'])

In [57]:
dfs

        store  sales
0        vivo  30000
1       apple  40000
2     samsung  65000
3  blackberry  45900

In [59]:
stores_sales = {'stores':['vivo', 'apple',  'samsung', 'blackberry'], 'sales':[30000, 40000, 65000, 45800 ]}

In [61]:
dfd = pd.DataFrame(stores_sales)

In [62]:
df_sales = pd.read_csv('bigmarket.csv')

In [63]:
df_sales

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [64]:
df_sales = pd.read_excel('bigmarket.xlsx')
df_sales

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [65]:
df_txt = pd.read_csv("three.txt", sep=' ')
df_txt

   136  786  huy
0  345  frt  mhu
1  678  vgt  dyt
2  987  234  bgt
3  912  724  ggt

In [66]:
df_txt = pd.read_csv("three.txt", sep=' ', header=None)
df_txt

     0    1    2
0  136  786  huy
1  345  frt  mhu
2  678  vgt  dyt
3  987  234  bgt
4  912  724  ggt

In [67]:
df_txt[1]

0    786
1    frt
2    vgt
3    234
4    724
Name: 1, dtype: object

In [68]:
list(df_txt[1])

['786', 'frt', 'vgt', '234', '724']

In [69]:
list(df_txt[0])

[136, 345, 678, 987, 912]

In [70]:
df_j = pd.read_json('bigmarket.json')
df_j

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24557
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961
11  March     B  26451
12  March     C  47814
13  March     D  36069
14  March     E  31874
15    Apr     A  27253
16    Apr     B  40241
17    Apr     C  47488
18    Apr     D  25432
19    Apr     E  33880
20    May     A  29487
21    May     B  40001
22    May     C  46482
23    May     D  46313
24    May     E  47594

In [71]:
df_jb = pd.read_json('example_1.json')
df_jb

ValueError: If using all scalar values, you must pass an index

In [72]:
df_jb = pd.read_json('example_2.json')
df_jb

                                                    quiz
maths  {'q1': {'question': '5 + 7 = ?', 'options': ['...
sport  {'q1': {'question': 'Which one is correct team...

In [74]:
df_jb.loc['sport', 'quiz']

{'q1': {'question': 'Which one is correct team name in NBA?',
  'options': ['New York Bulls',
   'Los Angeles Kings',
   'Golden State Warriros',
   'Huston Rocket'],
  'answer': 'Huston Rocket'}}

In [75]:
df_html = pd.read_html('bigmarket.html')
df_html

[    Unnamed: 0      A      B      C
 0            1  Month  Store  Sales
 1            2    Jan      A  31037
 2            3    Jan      B  20722
 3            4    Jan      C  24557
 4            5    Jan      D  34649
 5            6    Jan      E  29795
 6            7    Feb      A  29133
 7            8    Feb      B  22695
 8            9    Feb      C  28312
 9           10    Feb      D  31454
 10          11    Feb      E  46267
 11          12  March      A  32961
 12          13  March      B  26451
 13          14  March      C  47814
 14          15  March      D  36069
 15          16  March      E  31874
 16          17    Apr      A  27253
 17          18    Apr      B  40241
 18          19    Apr      C  47488
 19          20    Apr      D  25432
 20          21    Apr      E  33880
 21          22    May      A  29487
 22          23    May      B  40001
 23          24    May      C  46482
 24          25    May      D  46313
 25          26    May      E  47594]